/*
    동기와 비동기

    #동기란?
    -> 여러개의 작업이 있을때 순서대로 한번에 하나씩만 처리하는 방식
    -> 자바스크립트는 기본적으로 동기적으로 실행된다.
    
    장점: 실행흐름을 파악하기 쉽다.
    단점: 작업이 오래 걸리면 다음 작업을 진행하기 힘들어 성능이 악화된다.

    (쓰레드)
    TaskA (완료)-> TaskB (완료)-> TaskC


    #비동기란?
    -> 여러개의 작업이 있을때 순서대로 처리하지 않는 방식
    -> 작업의 동시 진행 가능
    -> 각각의 작업이 종료 되었을 때, 해당 결과를 이용해서
       또 다른 작업을 수행해야한다면 각각에 콜백함수를 붙여서 처리한다.

    비동기 처리가 가능한건 비동기 작업은 자바스크립트에서
    실행 되는 것이 아닌 Web APIs 라는 브라우저가 직접 관리하는
    별도의 공간에서 실행되기 때문이다.

    (비동기 쓰레드)
    TaskA (1초)
    TaskB (10초)
    TaskC (2초)
    ----------------------------->
*/



console.log(1);

setTimeout(()=>{ // Web APIs에서 처리
    console.log(2);
},3000);

console.log(3);